In [13]:
x=input('enter the colour')
if (x=='yellow' or x=='blue' or x=='green' or x=='red'): 
    print('primary colour')
else: 
    print('not aa primary colour')

enter the colourhi
not aa primary colour

In [17]:
!pip3 install pandas

Requirement already satisfied: pandas in ./anaconda3/lib/python3.10/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in ./anaconda3/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in ./anaconda3/lib/python3.10/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in ./anaconda3/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in ./anaconda3/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [38]:
!pip3 install numpy

Requirement already satisfied: numpy in ./anaconda3/lib/python3.10/site-packages (1.23.5)

In [39]:
import pandas as pd
import numpy as np

In [46]:
data=pd.read_csv('/home/placement/Desktop/list.txt')

In [47]:
data.describe()

           srno        pincode       marks
count  7.000000       7.000000    7.000000
mean   4.000000  545747.142857   95.571429
std    2.160247   37120.943098    5.798193
min    1.000000  504852.000000   85.000000
25%    2.500000  526312.500000   93.500000
50%    4.000000  532585.000000   98.000000
75%    5.500000  565593.000000   99.500000
max    7.000000  598982.000000  100.000000

In [48]:
data.head()

   srno         name  pincode        city  branch  marks
0     1        bhanu   534201         vij     ece     90
1     2       prasad   532401         viz     cse     85
2     3        shiva   520224  bhimavaram  civial    100
3     4  malikarjuna   532585         sri     eco     98
4     5         soma   598982         bhi     war     99

In [49]:
data.head

<bound method NDFrame.head of    srno         name  pincode        city  branch  marks
0     1        bhanu   534201         vij     ece     90
1     2       prasad   532401         viz     cse     85
2     3        shiva   520224  bhimavaram  civial    100
3     4  malikarjuna   532585         sri     eco     98
4     5         soma   598982         bhi     war     99
5     6         kala   504852         sri   peace     97
6     7         ravi   596985     village     csd    100>

In [50]:
data.head()

   srno         name  pincode        city  branch  marks
0     1        bhanu   534201         vij     ece     90
1     2       prasad   532401         viz     cse     85
2     3        shiva   520224  bhimavaram  civial    100
3     4  malikarjuna   532585         sri     eco     98
4     5         soma   598982         bhi     war     99

In [51]:
data.describe()

           srno        pincode       marks
count  7.000000       7.000000    7.000000
mean   4.000000  545747.142857   95.571429
std    2.160247   37120.943098    5.798193
min    1.000000  504852.000000   85.000000
25%    2.500000  526312.500000   93.500000
50%    4.000000  532585.000000   98.000000
75%    5.500000  565593.000000   99.500000
max    7.000000  598982.000000  100.000000

In [52]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   srno     7 non-null      int64
 1   name     7 non-null      object
 2   pincode  7 non-null      int64
 3   city     7 non-null      object
 4   branch   7 non-null      object
 5   marks    7 non-null      int64
dtypes: int64(3), object(3)
memory usage: 464.0+ bytes

In [54]:
data.tail(3)

   srno  name  pincode     city branch  marks
4     5  soma   598982      bhi    war     99
5     6  kala   504852      sri  peace     97
6     7  ravi   596985  village    csd    100